let messageStartBot = (firstName) => {
  return `سلام کاربر ${firstName} به ربات دریافت موزیک خوش آمدید 

جهت رفتن به لیست خواننده ها دستور /listsingers یا 
متن "لیست خواننده ها" را ارسال نمایید

جهت رفتن به موزیک های مورد علاقه دستور 
را ارسال نمایید /favoritesmusic 

جهت رفتن به خواننده های مورد علاقه دستور 
را ارسال نمایید /favoritessinger

جهت دعوت دوستان دستور /invitefriends و یا 
متن "دعوت دوستان" را ارسال نمایید

جهت رفتن به پنل ادمین دستور /adminpanel و یا
رفتن به "پنل مدیر" را ارسال نمایید

جهت رفتن به پشتیبانی می توانید دستور /help و یا 
متن "پشتیبانی" را ارسال نمایید

جهت رفتن به درباره ما دستور /aboutme و یا 
متن "درباره ما" را ارسال نمایید
`;
};

let replyMarkupStart = {
  reply_markup: {
    keyboard: [
      ["لیست خواننده ها", "دعوت دوستان"],
      ["خواننده های مورد علاقه", "موزیک های مورد علاقه"],
      ["پشتیبانی", "درباره ما", "پنل مدیر"],
    ],
    resize_keyboard: true,
    one_time_keyboard: true,
  },
};

let aboutme = `به بخش درباره ما خوش آمدید
این ربات به شما کمک می کند که موزیک های مورد علاقه خود را به 
راحتی بیابید و از شنیدن آنها لذت ببرید 

سوالی داشتید با ادمین ربات در میان بزارید 

ID: @sajad_salmankhn
`;

let help = `به بخش پشتیبانی خوش آمدید
هر گونه مشکل و یا سوالی در مورد بات دریافت موزیک داشتید 
می توانید از طریق ادمین ربات به اشتراک بگذارید 

ID: @sajad_salmankhn
`;
let results = {
  inline_keyboard: [
    [
      { text: `افزودن نظر به موزیک`, callback_data: "addComment" },
      { text: "بستن لیست نظرات", callback_data: "closeComments" },
    ],
  ],
};
let replyMarkupConments = (ctx) => {
  let data = {
    reply_to_message_id: ctx.message.message_id,
    reply_markup: results,
  };
  return data;
};

let nameMusicDelete = `نام موزیک و خواننده مورد نظر خود را جهت حذف از لیست علاقه وارد نمایید

⚠️لطفا توجه داشته باشید نام موزیک و خواننده وارد شده باید شامل "حذف" هم باشد بعنوان مثال: حذف مهراد جم دلی 

در غیر صورت اگر نام را بدون حذف وارد کنید موزیک حذف نمی شود`;

let addCommentMessage = `نظر خود را وارد نمایید
⚠️توجه داشته باشید حتما در آخر متن خود از ایموجی ✅ استفاده کنید تا نظر شما ثبت شود در غیر این صورت نظر شما ثبت نخواهد شد`;

let messageUpdateMusic = `ادمین عزیز جهت آپدیت موزیک های خواننده باید این نکات را دقت کنید:

1- موزیک های وارد شده باید زوج باشند
2- بعد از ارسال موزیک ها به ربات با ارسال update موزیک ها آپدیت می شوند
3- اگر خواننده یک اسم داشت قبل از اسم خواننده 1 را بگذارید در غیر این صورت اگر نام خواننده 3 حرفی بود 3 را قرار دهید
4- کاملا در افزودن موزیک دقت داشته باشید اگر اشتباهی رخ بدهد ویرایش آن مشکل ساز است
`;

let messageAddedMusic = `ادمین عزیز جهت افزودن موزیک به ربات باید این نکات را دقت کنید:

1- موزیک های وارد شده بعد از ارسال کلمه save به ربات افزوده خواهند شد
2- اگر خواننده یک اسم داشت قبل از اسم خواننده 1 را بگذارید در غیر این صورت اگر نام خواننده 3 حرفی بود 3 را قرار دهید 
3- کاملا در افزودن موزیک دقت داشته باشید اگر اشتباهی رخ بدهد ویرایش آن مشکل ساز است
`;

let deleteOneSinger = `جهت حذف خواننده از لیست علاقه باید قبل از نام خواننده کلمه حذف را وارد کنید
مثال: حذف مهراد جم 
درغیر این صورت اگر کلمه حذف نباشد خواننده از لیست حذف نخواهد شد.
    `;

let taskAdmin = (bot, messageText, replayMarkups, msgId, userId) => {
  return bot.editMessageText(messageText, {
    reply_markup: replayMarkups,
    message_id: msgId,
    chat_id: userId,
  });
};

module.exports = {
  messageStartBot,
  replyMarkupStart,
  aboutme,
  help,
  replyMarkupConments,
  nameMusicDelete,
  addCommentMessage,
  messageUpdateMusic,
  messageAddedMusic,
  taskAdmin,
  deleteOneSinger,
};
